app/controllers/calendar_items_controller.rb

  def index
    @calendar_items = CalendarItem.all
---
SELECT "calendar_items".* FROM "calendar_items"

  def create
    @calendar_item = CalendarItem.new(permitted_params)
    @calendar_item.save
---
INSERT INTO "calendar_items" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["body", "hello"], ["created_at", "2017-05-19 21:05:22.700317"], ["updated_at", "2017-05-19 21:05:22.700317"]]

  def show
    @id = params[:id]
    @calendar_item = CalendarItem.find(@id)
---
SELECT  "calendar_items".* FROM "calendar_items" WHERE "calendar_items"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def edit
    @calendar_item = CalendarItem.find(params[:id])
---
SELECT  "calendar_items".* FROM "calendar_items" WHERE "calendar_items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    calendar_item = CalendarItem.find(params[:id])
    calendar_item.update(permitted_params)
---
SELECT  "calendar_items".* FROM "calendar_items" WHERE "calendar_items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "calendar_items" SET "title" = $1, "body" = $2, "start_time" = $3, "end_time" = $4, "updated_at" = $5 WHERE "calendar_items"."id" = $6  [["title", "Hello"], ["body", "Hello"], ["start_time", "0005-02-17 10:00:00"], ["end_time", "0005-03-17 11:00:00"], ["updated_at", "2017-05-20 10:10:52.717992"], ["id", 4]]

  def destroy
    @calendar_item = CalendarItem.find(params[:id])
    @calendar_item.destroy
---
SELECT  "calendar_items".* FROM "calendar_items" WHERE "calendar_items"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "calendar_items" WHERE "calendar_items"."id" = $1  [["id", 16]]